# переменные начинаются обязательно с латинской буквы, либо с "_". Сама переменная может солдержать цифры.
# Название переменной чаще всего несет смысловую нагрузку, подразумевает, что в ней хранится.
name = 'Nanatoliy'
print(name)
name = 'Vladislav'
print(name)
# компьютер выполянет задачи последовательно, так что сначала он вывел 1 значение переменной, затем второе.
# есть два стиля записи переменных:
# camel case - разделение слов в переменнйо при помощи заглавных букв, и dateOfBirth = 05.06.1998
# snake case - разделение слов "_" нижним прочерком. date_of_birth = 05.06.1998
date_of_birth = '05.06.1998'
dateOfBirth = '22.03.1998'
print(date_of_birth)
print(dateOfBirth)

