#Старая задача
# 'длина слова'
print('Hello, world!')
print(type('Hello, world!'))
a='Hello, world!'
print(a)
print(len(a))
#Задача:суммы и разности
first = 5
second = 7
print(first + second)
print(first-second)
summa = 12
diff = -2
print(summa)
print(diff)
#Задача: Среднее арифметическое
first = 5
second = 9
third = 10
print((first+second+third)/3)
mean=8
print(mean)
# Задача:Простые строчки
first_string = 'Понедельник, '
second_string = 'Вторник'
print(first_string+second_string)
# Задача: сложная формула
a=10
b=100
c=1000
print(a+b+c)
f=(a*b)+(a*c)
print(((f)**3)/2)